app/views/breweries/show.html.erb

SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]
SELECT COUNT(*) FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]
---

<p> Number of beers: <%= @brewery.beers.count %> </p>