app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers"
---
  def index
    @beers = Beer.all

INSERT INTO "beers" ("brewery_id", "created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 1], ["created_at", Thu, 16 Jan 2014 13:15:13 UTC +00:00], ["name", "Lappari"], ["style", "lager"], ["updated_at", Thu, 16 Jan 2014 13:15:13 UTC +00:00]]
---
  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save

DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 11]]
---
  def destroy
    @beer.destroy

SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", "11"]]
---
    def set_beer
      @beer = Beer.find(params[:id])

SELECT "breweries".* FROM "breweries"
---
    def set_breweries_and_styles_for_template
    @breweries = Brewery.all